&НаКлиенте
Процедура ЗаполнитьВсеДанные(Команда)
	
    ЗаполнитьВсеДанныеНаСервере()
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеДанныеНаСервере()
	
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    
    ОбработкаОбъект.ФИОПользователя.Очистить();
    
    СписокПользователей = Новый Массив;
    СписокПользователей.Добавить("Иванов");
    СписокПользователей.Добавить("Петров");
    СписокПользователей.Добавить("Сидоров");
    СписокПользователей.Добавить("Смирнов");
    СписокПользователей.Добавить("Кузнецов");
    
    СписокУчеников = Новый Массив;
    СписокУчеников.Добавить("Алексей");
    СписокУчеников.Добавить("Дмитрий");
    СписокУчеников.Добавить("Сергей");
    СписокУчеников.Добавить("Андрей");
    СписокУчеников.Добавить("Михаил");
    
    Для Сч = 1 По 5 Цикл
        НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
        
        НоваяСтрока.ФИО = СписокПользователей[Сч-1];
        НоваяСтрока.Ученик = СписокУчеников[Сч-1];
        НоваяСтрока.Группа = ГенерацияСлучайногоСимвола(Сч);
      
    КонецЦикла;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Функция ГенерацияСлучайногоИмени(Счетчик)  
     
    СписокИмен = Новый Массив;
    СписокИмен.Добавить("Иван");
    СписокИмен.Добавить("Андрей");
    СписокИмен.Добавить("Сергей");
    СписокИмен.Добавить("Дмитрий");
    СписокИмен.Добавить("Алексей");
    СписокИмен.Добавить("Михаил");
    СписокИмен.Добавить("Владимир");
    СписокИмен.Добавить("Павел");
    СписокИмен.Добавить("Николай");
    СписокИмен.Добавить("Артем");
    
    ИндексИмени = (Счетчик - 1) % СписокИмен.Количество();
    
    Возврат СписокИмен[ИндексИмени] + Счетчик;
    
КонецФункции

&НаСервере
Функция ГенерацияСлучайногоСимвола(Счетчик)
    ГСЧ = Новый ГенераторСлучайныхЧисел(Счетчик);    
    СлучайнаяСтрока = "";
    // генерируем случайное число из 6-ти символов, например "d0c8Yf"
    Для Сч = 1 по 6 Цикл        
        Набор = ГСЧ.СлучайноеЧисло(1,3);    
        Если Набор = 1 Тогда
            // это число
            СлучайныйСимвол = ГСЧ.СлучайноеЧисло(0,9);    
        ИначеЕсли Набор = 2 Тогда
            // это Большая буква латиницы
            СлучайныйСимвол = Символ(ГСЧ.СлучайноеЧисло(65,90));
        ИначеЕсли Набор = 3 Тогда
            // это маленькая буква латиницы
            СлучайныйСимвол = Символ(ГСЧ.СлучайноеЧисло(97,122));
        КонецЕсли;
        СлучайнаяСтрока = СлучайнаяСтрока + СлучайныйСимвол;
    КонецЦикла;      
    Возврат(СлучайнаяСтрока);    
КонецФункции