
&НаСервере
Процедура ЗаполнитьФИО(Команда)
	Для Счетчик = 1 по 5 Цикл
     Сообщить(ГенерацияСлучайногоИмени(Счетчик));
КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ГенерацияСлучайногоИмени(Счетчик)
     
    СписокИмен = Новый Массив;
    СписокИмен.Добавить("Иван");
    СписокИмен.Добавить("Андрей");
    СписокИмен.Добавить("Сергей");
    СписокИмен.Добавить("Дмитрий");
    СписокИмен.Добавить("Алексей");
    СписокИмен.Добавить("Михаил");
    СписокИмен.Добавить("Владимир");
    СписокИмен.Добавить("Павел");
    СписокИмен.Добавить("Николай");
    СписокИмен.Добавить("Артем");
    
    ИндексИмени = (Счетчик - 1) % СписокИмен.Количество();
    
    Возврат СписокИмен[ИндексИмени] + Счетчик;
    
КонецФункции