#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьПользователя(Команда)
	
	Для Счетчик = 0 По Объект.КоличествоПользователей - 1 Цикл
		ЗаполнитьПользователяНаСервере();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗал(Команда)
	СоздатьЗалНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	
	Для Счетчик = 0 По Объект.КоличествоГрупп - 1 Цикл
	СоздатьГруппуНаСервере();
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчеников(Команда)
	ЗаполнитьУчениковНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьПользователяНаСервере()
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = "Новый Пользователь";
	НовыйПользователь.Записать();
	
    Объект.ФИОПользователя.Добавить().Пользователь = НовыйПользователь.Ссылка;
    
КонецПроцедуры

&НаСервере
Процедура СоздатьЗалНаСервере()
	НовыйЗал = Справочники.Залы.СоздатьЭлемент();
	НовыйЗал.Наименование = "Новый Зал";
	НовыйЗал.Записать();
	
    Объект.ФИОПользователя.Добавить().Зал = НовыйЗал.Ссылка;
    
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппуНаСервере()
	НоваяГруппа = Справочники.Группы.СоздатьЭлемент();
	НоваяГруппа.Наименование = "Новая Группа";
	НоваяГруппа.Тренер = Справочники.Пользователи.НайтиПоНаименованию("Илья");
	НоваяГруппа.Зал = Справочники.Залы.НайтиПоНаименованию("Центральный");
	НоваяГруппа.Ученики.Добавить().Ученик = Справочники.Ученики.НайтиПоНаименованию("Саня");
	НоваяГруппа.Ученики.Добавить().Ученик = Справочники.Ученики.НайтиПоНаименованию("Паня");
	НоваяГруппа.Ученики.Добавить().Ученик = Справочники.Ученики.НайтиПоНаименованию("Илня");
	НоваяГруппа.Записать();
	
    Объект.ФИОПользователя.Добавить().Группа = НоваяГруппа.Ссылка;
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчениковНаСервере()
	НовыйУченик = Справочники.Ученики.СоздатьЭлемент();
	НовыйУченик.Наименование = "Новый Ученик";
	НовыйУченик.Записать();

    Объект.ФИОПользователя.Добавить().Ученик = НовыйУченик.Ссылка;
    
КонецПроцедуры
#КонецОбласти

