#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьПользователя(Команда)
	ЗаполнитьПользователяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗал(Команда)
	СоздатьЗалНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	СоздатьГруппуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчеников(Команда)
	ЗаполнитьУчениковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователяНаСервере()
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = "Новый Пользователь";
	НовыйПользователь.Записать();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

    НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
    НоваяСтрока.СозданыеЭлементы = НовыйПользователь.Наименование;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура СоздатьЗалНаСервере()
	НовыйЗал = Справочники.Залы.СоздатьЭлемент();
	НовыйЗал.Наименование = "Новый Зал";
	НовыйЗал.Записать();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

    НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
    НоваяСтрока.СозданыеЭлементы = НовыйЗал.Наименование;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппуНаСервере()
	НоваяГруппа = Справочники.Группы.СоздатьЭлемент();
	НоваяГруппа.Наименование = "Новая Группа";
	НоваяГруппа.Тренер = Справочники.Пользователи.НайтиПоНаименованию("Илья");
	НоваяГруппа.Зал = Справочники.Залы.НайтиПоНаименованию("Центральный");
	НоваяГруппа.Ученики.Добавить().Ученик = Справочники.Ученики.НайтиПоНаименованию("Саня");
	НоваяГруппа.Ученики.Добавить().Ученик = Справочники.Ученики.НайтиПоНаименованию("Паня");
	НоваяГруппа.Ученики.Добавить().Ученик = Справочники.Ученики.НайтиПоНаименованию("Илня");
	НоваяГруппа.Записать();

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

    НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
    НоваяСтрока.СозданыеЭлементы = НоваяГруппа.Наименование;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчениковНаСервере()
	НовыйУченик = Справочники.Ученики.СоздатьЭлемент();
	НовыйУченик.Наименование = "Новый Ученик";
	НовыйУченик.Записать();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

    НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
    НоваяСтрока.СозданыеЭлементы = НовыйУченик.Наименование;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

#КонецОбласти