
&НаСервере
Процедура ЗаполнитьФИОНаСервере()
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    
    Для Счетчик = 1 По 5 Цикл
        НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
        НоваяСтрока.ФИО = ГенерацияСлучайногоИмени(Счетчик);
    КонецЦикла;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
    
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьФИО(Команда)
	
   ЗаполнитьФИОНаСервере()
   
КонецПроцедуры

&НаСервере
Функция ГенерацияСлучайногоИмени(Счетчик)
     
    СписокИмен = Новый Массив;
    СписокИмен.Добавить("Иван");
    СписокИмен.Добавить("Андрей");
    СписокИмен.Добавить("Сергей");
    СписокИмен.Добавить("Дмитрий");
    СписокИмен.Добавить("Алексей");
    СписокИмен.Добавить("Михаил");
    СписокИмен.Добавить("Владимир");
    СписокИмен.Добавить("Павел");
    СписокИмен.Добавить("Николай");
    СписокИмен.Добавить("Артем");
    
    ИндексИмени = (Счетчик - 1) % СписокИмен.Количество();
    
    Возврат СписокИмен[ИндексИмени] + Счетчик;
    
КонецФункции