
&НаСервере
Процедура ЗаполнитьУчениковНаСервере()
	НоваяГруппа = Справочники.Ученики.СоздатьЭлемент();
	НоваяГруппа.Наименование = "Новый Ученик";
	НоваяГруппа.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчеников(Команда)
	ЗаполнитьУчениковНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппуНаСервере()
	НоваяГруппа = Справочники.Группы.СоздатьЭлемент();
	НоваяГруппа.Наименование = "Новая Группа";
	НоваяГруппа.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	СоздатьГруппуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователяНаСервере()
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = "Новый Пользователь";
	НовыйПользователь.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПользователя(Команда)
	ЗаполнитьПользователяНаСервере();
КонецПроцедуры


