
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Группа") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.Ссылка;

		Для Каждого ТекСтрокаУченики из ДанныеЗаполнения.Ученики Цикл
			НоваяСтрока = Ученики.Добавить();
			НоваяСтрока.Ученик = ТекСтрокаУченики.Ученик;
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры

