Процедура ОбработкаПроведения(Отказ,Режим) 
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПосещенияУчеников
	Движения.ПосещенияУчеников.Записывать = Истина;
	Для Каждого ТекСтрокаУченики из Ученики Цикл
		Движение = Движения.ПосещенияУчеников.Добавить();
		Движение.Период = Дата;
		Движение.Ученик = ТекСтрокаУченики.Ученик;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры



#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Группы") Тогда
		
		Группа = ДанныеЗаполнения;

		Ученики.Очистить();
		Для Каждого ТекСтрокаУченики из ДанныеЗаполнения.Ученики Цикл
			НоваяСтрока = Ученики.Добавить();
			НоваяСтрока.Ученик = ТекСтрокаУченики.Ученик;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
