#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Группы") Тогда
		
		Группа = ДанныеЗаполнения;
		Тренер = ДанныеЗаполнения.Тренер;
		Зал = ДанныеЗаполнения.Зал;

		Ученики.Очистить();
		Для Каждого ТекСтрокаУченики из ДанныеЗаполнения.Ученики Цикл
			НоваяСтрока = Ученики.Добавить();
			НоваяСтрока.Ученик = ТекСтрокаУченики.Ученик;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
