#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим) 
	
	Движения.ПосещенияУчеников.Записывать = Истина;
	Для Каждого ТекСтрокаУченики из Ученики Цикл
		Движение = Движения.ПосещенияУчеников.Добавить();
		Движение.Период = Дата;
		Движение.Ученик = ТекСтрокаУченики.Ученик;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Группы") Тогда
		
		Группа = ДанныеЗаполнения;

		Ученики.Очистить();
		Для Каждого ТекСтрокаУченики из ДанныеЗаполнения.Ученики Цикл
			НоваяСтрока = Ученики.Добавить();
			НоваяСтрока.Ученик = ТекСтрокаУченики.Ученик;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
